{
    "chef": ["Soma Yukihira"],
    "dish_name": "Roast Pork, Just Kidding",
    "img_link":"",
    "description": "This is Soma's innovative dish, which is served to repel the vicious urban residential planner, Yaeko Minegasaki, from destroying Restaurant Yukihira. Even when all the meat materials were sabotaged in his kitchen, Sōma managed to turn the tides by using some of the groceries he had bought as his ingredients to create artificial meat.",
    "ingredients": [
      "6 white potatoes",
      "3 Eringi mushrooms",
      "1 large white onion or 2 medium white onions",
      "1 sprig of rosemary",
      "2 tablespoons butter (30ml) (you could always use a bit more)",
      "2 packs of thick-cut bacon",
      "1 cup or 250ml of red wine (We used Pinot Noir since it's preferable for cooking)",
      "1/4 cup or 60ml of sake (Any sake labeled as 'sweet' should do)",
      "2 tablespoons or 30ml of soy sauce",
      "1 sprig of parsley or any garnish"
    ],
    "recipe": [
        
          "Peel 6 white potatoes.", 
          "Wash the potatoes then slice them into quarters or halves, depending on size.",
          "Chop the 3 Eringi Mushrooms and 2 medium white Onions into Equally-sized Brunoise (small 5-6cm cubes)",
          "Steam potatoes until soft (about 15-20 minutes).\n- DO NOT steam or microwave the mushrooms.","Prep the pan with a tablespoon of butter.\n- Pan fry onions and mushrooms until caramelized or fully golden.",
          "Mash into small chunks in a large bowl. Do not mash too much, you want to avoid it being frothy to form it to shape.",
          "Mix until the ingredients are even in the bowl.",
          "Pick the rosemary off its stem.\n- Set aside.",
          "Add a few sprinkles of salt to the top of the bowl.",
          "Form the Fake Roast by letting the mix cool until touchable (more than 5 minutes). CAUTION HOT\n- Take all of the mix and form it into a log shape.","Wrap the Roast in Bacon",
          "Amount: 2 packs of thick-cut bacon.\n- Wrap the roast fully, try not to leave any gaps, otherwise, the potatoes will seep out when the bacon tightens.\n- There is no surefire way of doing this, just coat it to the best of your ability.",
          "Tie the roast with the twine. It doesn’t need to be anything fancy, just wrap it around a few times.\n- Intertwine the rosemary afterward.",
          "Bake at 375ºF or 190ºC for 30-45 minutes or until bacon is golden (cook longer for crispy bacon), turning halfway.",
          "Amount: 1 Cup, or 250ml.\n- Bring the wine to a boil (~10 minutes) on medium-high heat in a frying pan. The aim is to reduce it.",
          "Amount: 1 tbs of butter, 1/4 cup of sake, 2 tbs of soy sauce.\n- Melt the butter into the boiling wine.\n- Pour the soy sauce and sake into the sauce.\n- Continue to cook for 2-3 minutes.",
         "When the baking is done, remove the twine and rosemary, they are not to be eaten.",
         "Pour the finished sauce onto the roast (make sure the roast is on a plate to hold the extra sauce). Pour slowly.",
         "Add a garnish to the top of the dish, we used parsley, the anime used watercress.",
         "Serve"
    ]
  },

  {
    "chef": ["Soma Yukihira"],
    "dish_name": "Chaliapin Steak Don",
    "img_link":"",
    "description": "The Chaliapin Steak is an original Japanese steak. It is a dish made in 1936 for the Russian opera singer Feodor Chaliapin when he visited Japan. At the time, he was suffering from toothaches and said, "I want to eat a tender steak." This dish was devised to answer to his request.
    Donburi (丼, literally "bowl", also frequently abbreviated as "don", less commonly spelled "domburi") is a Japanese "rice bowl dish" consisting of fish, meat, vegetables or other ingredients simmered together and served over rice. Donburi meals are served in oversized rice bowls also called donburi. Donburi are sometimes called sweetened or savory stews on rice.",

    "ingredients": [
      "Beef Sirloin (Supermarket discount)",
      "Lots of Onion",
      "Garlic (mix with onion)",
      "Pepper",
      "Salt",
      "Potato Starch",
      "Rice (Donburi Bowl)",
      "Umeboshi Paste",
      "Pickled Plum",
      "Sauce",
      "Red Wine",
      "Soy Sauce",
      "Butter"
    ],
    "recipe": [
      "Chop the onions finely.",
      "Remove the tendons from the beef and beat it with a meat tenderizer until as flat as possible.",
      "Cover meat on both sides with the chopped onion and leave for 30 minutes or more. Remove the onion and add salt and pepper.",
      "Cook the steak to your preference (most would prefer medium-rare). Remove from heat and melt 1 tablespoon of butter in a frying pan and fry the onion used for the beef until it changes color. Adjust the flavor with salt and pepper, then move the onion to the steak.",
      "Melt the remaining butter in the frying pan and fry the sides of the meat before taking it out.",
      "Making the Sauce:",
      "Add red wine to the frying pan used for the beef to deglaze it. Boil down the wine while scraping off the meat juice.",
      "Add soy sauce and mix with everything. Adjust seasonings to personal preferences.",
      "Thicken with dissolved potato starch.",
      "Put rice mixed with Umeboshi paste (pickled plum) in the donburi bowl. Place the beef on top and add plenty of sauce. Top with the finely chopped, cooked onions."
      ]
},
{
    "chef": ["Soma Yukihira"],
    "dish_name": "Apple Risotto",
    "img_link":"",
    "description": "Risotto /rɪˈzɒtoʊ/ (Italian: [riˈzɔtto] or [riˈsɔtto]) is a northern Italian rice dish cooked in a broth to a creamy consistency. The broth can be derived from meat, fish, or vegetables. Many types of risotto contain butter, wine, and onion. It is one of the most common ways of cooking rice in Italy. Saffron was originally used for flavor and its attractive yellow color.",
    "ingredients": [
        "1/2 Apples",
        "1 teaspoon of Lemon Juice",
        "1/4 of Onion (Sauteed)",
        "2 tablespoons of Butter",
        "1/2 cup of Rice",
        "2 tablespoons of White Wine",
        "1 cup of Apple Juice",
        "1 cup of Water",
        "1 teaspoon of Granulated Consommé",
        "Salt & Pepper",
        "4 slices of Thick-Cut Bacon",
        "Black Pepper",
        "Powdered Cheese"
      ], 
    "recipe": 
     [
        "Cook the bacon in a frying pan until it's crispy and set it aside.",
        "Peel the apple and dice it into cubes of 1cm³.",
        "Mince the onion.",
        "Heat the butter in a frying pan and sauté the onions.",
        "Add the rice to (4) and cook until it's transparent.",
        "Add the white wine to (5) and cook it until the alcohol burns off.",
        "Mix the apple juice, water, and consommé. Slowly add this 1/8 cup at a time to (6) simmering on low heat for 15 minutes (until all the liquid is absorbed).",
        "Add the apple dices and lemon juice to (7) and season it to taste with salt and pepper.",
        "Place (8) on a plate and top it with (1).",
        "You can use black pepper or powdered cheese as a topping."  
      ]  
    },
  {
    "chef": ["Soma Yukihira"],
    "dish_name": "Cheese-Feathered Hanetsuki Gyōza",
    "img_link":"",
    "description": "The Japanese word gyōza (ギョーザ, ギョウザ) was derived from the reading of 餃子 in the Jilu Mandarin (giǎoze) and is written using the same Chinese characters. The selection of characters indicates that the word is of non-Japanese origin. Following the Second World War, Japanese soldiers who returned from Manchuria brought home gyōza recipes.",
    "ingredients": [
    "Chicken Wings (Big)",
    "Parmesan Cheese (Grated)",
    "Vegetable Oil"
    "Pork (Ground)",
    "Ginger (Diced)",
    "Garlic Chives (Diced)",
    "Cabbage (Diced)",
    "Pork Jowl (Diced)",
    "Leek (Diced)",
    "Shiitake Mushrooms (Diced)"
    "Shoyu (Soy Sauce)",
    "Sake",
    "Sugar",
    "Potato Starch",
    "Sesame Oil",
    "Oyster Sauce"
    "Vinegar",
    "Ketchup",
    "Chicken Bouillon",
    "Water",
    "Potato Starch",
    "Sesame Oil"
    ],
    "recipe": [
      "Use a pair of kitchen scissors to remove the two bones inside each of the 16 chicken wings. Mix 2 tablespoons each sake and soy sauce and 1 tablespoon of sugar.",
      "Dice the 1/8 head of cabbage, 1/2 bundle of leeks and 2-3 shiitake mushrooms. Grate the 2 thumbs of   ginger and the 2 clove's of garlic. Chop the 4 slices of pork jowl into small pieces.",
      "Mix the ground pork and the pork jowl in a bowl until the mixture looks whiteish. Add 1 tablespoon each of potato starch, soy sauce, sugar, and sesame oil and 1 teaspoon of oyster sauce and thoroughly mix together. Then add in the cabbage, leeks, shiitake, mushrooms, garlic, and ginger and mix again.",
      "Take the chicken wings from step 1. Stuff with 1/16th of the mixture from step 3 and pinch closed. Repeat it for all 16 wings.",
      "Heat the vegetable oil in a skillet or a frying pan. Place the wings from step 4 in the pan, skin-side up, and fry until the bottoms are browned. Flip them over skin-side down and dust with 60 grams of powdered cheese. Pour in the 100cc of water, cover and turn down to low heat. Let steam for 10 minutes.",
      "Once all the water has steamed off and the wings are cooked through, remove from heat and plate them browned-side up. (Drizzle with the sweet and sour sauce if desired. They can be especially delicious as a Donburi Rice Bowl when put on top of white rice and drizzled with sauce.)",
      "Options [make Sweet & Sour Sauce]",
      "Put 2 tablespoons each of vinegar, sugar and ketchup and 2 teaspoon each of soy sauce and chicken bouillon, 200cc of water, 1 tablespoon of potato starch, and 1 teaspoon of sesame oil into a pot and stir together well.",
      "Heat until boiling. Stir the mixture until thickened.",   
      "Serve"
      ]
  },
  {
    "chef": ["Ikumi Mito", "Soma Yukihira"],
    "dish_name": "Sumire Karaage Roll",
    "img_link":"",
    "description": "Karaage (唐揚げ or 空揚げ or から揚げ [kaɾaaɡe]), is a Japanese cooking technique in which various foods — most often chicken, but also other meat and fish — are deep fried in oil. The process involves lightly coating small pieces of the meat or fish with a seasoned wheat flour or potato starch mix, and frying in a light oil. Occasionally, the foods are marinated prior to coating with the seasoning mix. The process is similar in technique to the preparation of tempura. Bánh Xèo [ɓǎɲ sɛ̂w], literally 'sizzling cake', named for the loud sizzling sound it makes when the rice batter is poured into the hot skillet is a Vietnamese savory fried pancake made of rice flour, water, turmeric powder. It is stuffed with individual preferences, and served vegetarian or with meat. Some common stuffings include: pork, shrimp, diced green onion, mung bean, and bean sprouts.",
    "ingredients":  [
        "Chicken Thigh Meat",
        "Soy Sauce",
        "Chili Peppers",
        "Cornstarch",
        "Lettuce",
        "Perilla",
        "Flat-Leaf Parsley",
        "Black Pepper",
        "Bánh Xèo",
        "Rice Flour",
        "Water",
        "Coconut Milk",
        "Sauce",
        "Chili Sauce",
        "Fish Sauce",
        "Tomatoes",
        "Chicken Thighs (approximately 500 grams)",
        "1/8 Apple",
        "1/8 Onion",
        "Frying Oil",
        "Potato Starch/Corn Starch",
        "Beginning of Set A. 1/4 Teaspoon Chicken Bouillon",
        "2 Tablespoons Soy Sauce",
        "2 Tablespoons Sake",
        "1/2 Teaspoon Salt",
        "1/4 Teaspoon Black Pepper",
        "1/4 Teaspoon Cayenne Pepper",
        "3 Tablespoons Hot Sauce",
        "Beginning of Set C. 1 Tablespoon Lemon Juice",
        "1 Tablespoon Fish Sauce"
        "Beginning of Set B. 100 grams Low Protein Flour (such as cake and pastry flour)",
        "100 grams Joshinko Rice Flour",
        "1 Teaspoon Turmeric",
        "200 CC Coconut Milk",
        "250 CC Water",
        "4 Teaspoons Sesame Oil",
        "Cooking Oil",
        "Cilantro or Parsley",
        "Green Perilla Leaves",
        "Lettuce Leaves",
        "Black Pepper"
      ],
      
    "recipe":  [
       "Cut chicken thighs, onion, and apple into bite-sized pieces, do not peel the apple.",
       "Put the Apple and Onion from Step 1 into a food processor and add (Set A) and Puree.",
       "Put Step 2 in a plastic bag and add the chicken from Step 1. Rub the meat well with 2 and then let sit in the refrigerator overnight to marinate. (for shorter time periods, rub the meat well with Step 2 for 5 minutes, then let marinate for 20 minutes)",
       "Heat frying oil to 350°F. Lightly coat Step 3 with potato starch and deep-fry for 5 minutes, or until golden brown. While frying, use a skimmer to scoop the meat out of the oil briefly one or two times to air (this gives it the effect of being 'twice-fried').",
       "Make the Banh Xeo batter. Put (Set B) in a bowl and mix. Slowly add coconut milk, water, and beat into a batter with a mixer.",
       "Heat the cooking oil in a frying pan then add 1/4 of Step 5. Quickly spread it thinly across the pan and cook on low heat. Once the edges start turning up, add one teaspoon of sesame oil all the way around the edges and cook until crispy. Quickly flip with a spatula, briefly cook the other side, and then move to a plate. Cook the remaining three portions of the batter in the same way.",
       "Place the cilantro, green perilla leaves, and lettuce leaves onto Step 6 and add the fried chicken from Step 4. Quickly mix together the hot sauce from (Set C) and pour over the chicken, top with black pepper, and done!",
       "Options [make Sweet & Sour Sauce]",
       "Put 2 tablespoons each of vinegar, sugar and ketchup and 2 teaspoon each of soy sauce and chicken bouillon, 200cc of water, 1 tablespoon of potato starch, and 1 teaspoon of sesame oil into a pot and stir together well.",
       "Heat until boiling. Stir the mixture until thickened."  
      ]
  },
  {
    "chef": ["Ryo Kurokiba"],
    "dish_name": "Autumn Pacific Saury Cartoccio",
    "img_link":"",
    "description": "A dish utilizing the usage of heat resistant film, multiple shellfish and herb butter to create a delicious pacific saury dish that submerges anyone in an ocean of rich flavor and aroma.",
    "ingredients": [
      "Seasonal Pacific Saury",
      "Herb Butter",
      "Regular Butter",
      "Garlic",
      "Black Pepper",
      "Parsley",
      "Thyme",
      "Shellfish",
      "Shrimp",
      "Mussels",
      "Manila Clams",
      "Mushrooms",
      "Cherry Tomatoes",
      "Lemon Slices",
      "Olive Oil",
      "Wrapping",
      "Heat Resistant Film"
    ],
    "recipe": [
          "Making the Herb Butter:\nWarm the butter to room temperature.\nMix in the garlic, black pepper, parsley, and thyme. Wrap in plastic wrap and set in the freezer to chill.",
          "Making the Cartoccio:\nCut the cherry tomatoes in half and slice the mushrooms.\nMake a slit along the back of the shrimp and devein them.\nSprinkle the pike fillets with salt and let sit for ten minutes. Pat with a paper towel to remove excess moisture.",
          "In the center of a sheet of parchment paper, place the tomatoes, mushrooms, shrimps, pacific saury, and steamed clams.\nPlace the butter on top, and carefully wrap the parchment paper firmly closed.",
          "Bake in the oven at 400 degrees Fahrenheit (or 205 degrees Celsius) for 20 minutes.",
          "Remove from the oven, open the wrap, place the lemon slices, and serve."
      ]
  },
  {
    "chef": ["Soma Yukihira", "Erina Nakiri", "Joichiro Yukihira"],
    "dish_name": "Hachis Parmentier",
    "img_link":"",
    "description": "This French dish consists of an outer layer of mashed potatoes with an inside consisting of diced entrecôte. For garnish, they use an Alsatian Potato Crepe which contains finely-grated potatoes with crepe batter. They also made a Sardine Pomme Galette that has potatoes, cheese, and semi-dried sardines. Combined with a Meat Bordelaise Sauce which is made by using pan drippings from the entrecôte and bordeaux wine, all served in a single plate.",
    "ingredients": [
      "The mashed potatoes consist of potatoes and entrecôte.",
      "The alsation potato crepe consists of Crepe Batter and Finely Grated Potatoes.",
      "The sardine pomme galette consists of butter, Potatoes, Cheese, and Sardines (Semi-Dried)."
      "The meat bordelaise sauce consists of Pan Drippings, Entrecôte and, Red Bordeaux Wine (full bottle).",
      "Garnishes are; Cheese and Parsley Leaf."
      "Serve."
    ],
    "recipe": [ 
      "Create a crepe batter by including finely grated potatoes and cook on a skillet till the texture is chewy.",
      "Create the pomme galette by adding sliced potatoes, cheese, and semi-dried sardines to a hot frying pan. Make sure the potatoes are spread out thinly and fry till the mixture is crisp.",
      "Use the crepe to wrap both the pomme galette and mashed potatoes."
      "Grill a steak on a frying pan till it is short of well done then remove it. Cut into bite-sized pieces.",
      "Reduce close to a whole bottle of Bordeaux on the pan with the bordelaise to create the sauce."
      "Combine both the meat and the sauce inside the crepe."
      ]
    },
  {
    "chef": ["Kojiro Shinomiya"],
    "dish_name": "Quiche De Légumes Oubliés",
    "img_link": "",
    "description": "A Quiche (/ˈkiːʃ/ KEESH) is a savory open tart or flan consisting of pastry crust filled with eggs, milk or cream, and cheese, meat, seafood or vegetables. Quiches can be served hot or cold, and are part of French cuisine but are also popular in other countries, particularly as party food. It utilizes burdock root, an uncommon ingredient in French cuisine.",
    "ingredients": [
      "Pie crust",
      "Minced_chicken",
      "Western_maitake",
      "Slow-sauteed_mushroom",
      "Butter",
      "Burdock_root",
      "Appareil consists of; Eggs, Soy Sauce, White Miso, Cheese, Milk (as base)",
      "Filling consists of; Spinach and Bacon"
    ],
    "recipe":  [
      "Mince the chicken for preparation."
      "Sautee the mushrooms, hen-of-the-woods, and shimeji with butter."
      "Create an appareil by cooking eggs, soy sauce, and white miso over a saucepan till it reaches the desired consistency."
      "Place the minced chicken and the sauteed ingredients over the pie crust in an oven-ready pan."
      "Pour in the appareil to coat the ingredients and reach almost to the top of the crust."
      "Place the pan into the oven and cook till desired texture is reached."
      ]
    },
    
  {
    "chef": ["Soma Yukihira"],
    "dish_name": "Curry Risotto Omurice",
    "img_link": "",
    "description": "Curry is an umbrella term referring to a number of dishes originating in the cuisine of the Indian subcontinent. Risotto is a northern Italian rice dish cooked in a broth to a creamy consistency. Omurice is an example of yōshoku consisting of an omelette made with fried rice and usually topped with ketchup. With omu and raisu being contractions of the words omelette and rice, the name is an example of wasei-eigo. It is a popular dish both commonly cooked at home and often found at western style diners in Japan. Pressing a spoon on it causes an aroma explosion stemming from his usage of Mango Chutney.",
    "ingredients": 
      [ "Broth"
        "600g Beef",
        "600g Chicken",
        "1 Onion",
        "2 Carrots",
        "Thyme and Bay leaves",
        "3 tbsp Curry Powder",
        "1L Water",
        "2 Cloves",
        "mango_chutney"
        "1 Mango",
        "1 Apple",
        "1 Banana",
        "1 Carrot",
        "1 Onion",
        "1 Garlic Clove",
        "7cl Cider Vinegar",
        "10cl Water",
        "2 tbsp Honey",
        "5g Ginger",
        "1 tsp Cardamom",
        "1 tsp Cumin",
        "2 Cloves",
        "omurice_risotto",
        "2 Eggs",
        "200g Arborio Rice",
        "100g Ground Beef",
        "1 Onion",
        "40g Butter",
        "1L Bouillon (Broth)",
        "Chicken Bones",
        "Beef Tendon",
        "125g Mango Chutney",
        "Sauce is a mixture of Oyster Sauce and Honey",
        "Garnish is Parsley"
  ],
    "recipe": [
    "Peel and chop the carrots and onions into large chunks.",
    "Tie the thyme and bay leaf together with a string.",
    "Place the onions into a hot pot along with cloves.",
    "Add in the curry powder, chicken, and beef.",
    "Cover with water and add the carrots, plus the tied thyme and bay leaf.",
    "Skim the top of the broth for scum. Add water as necessary to keep the ingredients submerged.",
    "Strain the broth, separating the liquids and tossing out the solids.",
    "For the chutney, start by dicing the mango, onion, garlic, carrots, apple, banana.",
    "Add the chopped onions to a hot pan with oil. While the onions are cooking, add cardamom, cloves, cumin, cloves, and honey.",
    "Add the chopped vegetables to the pan as well, mixing everything together.",
    "Cover the pan and let cook until the chutney is thick and fragrant.",
    "Create the sauce by combining oyster sauce and honey and mixing together. Optionally, store inside a squeeze bottle to control the amount you use when adding to the dish.",
    "For the omurice risotto, melt the butter in a frying pan.",
    "Add in chopped onions and ground beef.",
    "Once the beef is cooked through, add the unwashed rice.",
    "Add in the broth a spoonful at a time, making sure the liquid is absorbed by the rice before adding the next one. Repeat till the liter of broth is finished.",
    "Add in the mango chutney and mix.",
    "Crack two eggs in a bowl and whisk.",
    "Add oil to a hot frying pan and pour the eggs to cook at least till the point where the bottom is solid.",
    "Place the curry risotto on top of the eggs and fold into an omelette.",
    "Add the sauce and garnish as desired." 
      ]
    }, 
    {
      "chef": ["Akira Hayama"],
      "dish_name": "Fried Bear",
      "img_link": "",
      "description": "This is a dish based off of the popular Southern United States dish fried chicken, substituting chicken meat with bear meat instead. Just looking at its sparkling surface will make you salivate. With the gravy sauce, just a drop will make the diner its pet. Combined with the bear, it becomes stimulating and spicy, yet mellow and sweet. And by using his mastery of spices, he transforms the bear's natural bone stench into a highly intricate constructed tower of flavor. Overall, it is a delicate balance between fragrance and taste.",
      "ingredients": [
          "Bear Roast that is Sliced Thick, Marinated & Deep Fried",
          "Marinated purée consisting of Garlic, Ginger, and Onion",
          "Frying Batter consisting of Eggs and Potato Starch",
          "Frying Oil",
          "Cajun Spice Blend",
          "Gravy Sauce",
          "Biscuits"
      ],
      "recipe": [
        "Slice the meat into thick slices, marinating it in garlic, ginger, and onion purée to soften it.",
        "Create the batter with eggs and potato starch.",
        "Heat up oil in a frying pan.",
        "Coat the bear slices in batter and add them to the frying pan.",
        "To make the sauce, use the bear broth and add wheat flour and milk till it thickens.",
        "After the mixture has become fragrant and slightly browned, add the seasonings and spices.",
        "Add cajun spice and salt to the bear meat, then fry with thick batter.",
        "Crush juniper berries and add them to the marinade."
      ]
    },
    {
      "chef": ["Etsuya Eizan"],
      "dish_name": "Hainan Ji Fan",
      "img_link": "",
      "description": "Hainan Ji Fan is offered as a set meal of boiled satsuma jidori (which is a type of high-quality poultry) garnished with cilantro, jasmine rice that was cooked in the water used to boil the satsuma jidori and a side of salad. The dish comes with a side of three sauces: a chili sauce that also uses satsuma jidori boiling water, a ginger sauce which contains the oil that was used from frying the satsuma jidori, and siu-dahm. This dish is also known as Khao Man Kai (ข้าวมันไก่) in Thailand, Hainanese Chicken Rice, and other various names. It is a popular dish and a staple on menus all across the region of southeast Asia.",
      "ingredients":  [
        "Garlic", 
        "Ginger", 
        "Satsuma Jidori Oil", 
        "Satsuma Jidori Skin (Sauteed)", 
        "Butter",
        "Satsuma Jidori Fat",
        "Uncooked Long-Grain Jasmine Rice", 
        "Satsuma Jidori Oil",
        "Satsuma Jidori Stock",
        "Satsuma Jidori", 
        "Chicken Feet", 
        "Drumettes", 
        "Cilantro",
        "English Cucumber", 
        "Cherry Tomato", 
        "Cilantro",
        "Satsuma Jidori Stock",
        "Cilantro",
        "Chili Peppers", 
        "Satsuma Jidori Stock",
        "Cilantro",
        "Ginger Sauce"
        "Soy Sauce"
      ],
      "recipe": [
        "Remove the skin and fat from the Satsuma Jidori and save for later.",
        "Bring a pot of water up to a boil then turn off the heat. Place the skinless chicken into the pot with the lid on for about 30 minutes or until done, allowing the residual heat to slowly cook the meat. The water cooking the chicken will become the stock.",
        "To create the oil, sautee the chicken skin with the chicken fat and butter then separate from the chicken piece. After the skin and fat are fully rendered, separate both from the oil.",
        "Use the oil to stir fry the garlic, ginger, and the uncooked jasmine rice. Remove from heat once it becomes fragrant.",
        "After the chicken has been cooked down to the center, remove it from the pot and split the bird into pieces, such as wings and drumettes. Place them back into the stock along with cilantro, and turn on the heat again.",
        "Place the previously stir-fried raw rice into the heated stock to cook it.",
        "After cooking, separate both rice and pieces from the soup. If desired, cut the meat to bite-sized pieces.",
        "Pour the soup into a bowl and place both rice and chicken onto a plate.",
        "For the chili sauce, mix the satsuma jidori's stock with chili peppers.",
        "For the ginger sauce, mix the ginger with the satsuma jidori oil."
      ]
    },
    {
      "chef": ["Soma Yukihira"],
      "dish_name": "Charcoal Grilled Venison Round Steak~Chestnut Sauce~",
      "img_link": "",
      "description": "It has a mellow flavor, and Sōma used chestnuts to create a unique sauce. He used coffee to increase the richness of the sauce.",
      "ingredients": [
        "Venison Round Steak (Charcoal Braised)",
        "Marinade",
        "Onions (Finely Diced)",
        "Garlic (Finely Diced)",
        "Soma-Style Chestnut Sauce",
        "Fond de Veau (Reduced)",
        "Cinnamon Stick",
        "Orange Zest",
        "Chestnuts (Sweet Roasted & Minced)",
        "Sugar",
        "Coffee (Instant Ground)",
        "Coffee Beans",
        "Garnish",
        "Chestnuts (Sweet Roasted)",
        "Cinnamon Stick"
      ],
      "recipe_steps": [
        "Remove tendons from the meat.",
        "Finely dice the onions and garlic.",
        "Smear over the meat and allow it to marinate.",
        "After marinating, place the meat on a hot charcoal brazier and heat till cooked.",
        "How to make Soma-Style Chestnut Sauce:",
        "Place fond de veau, cinnamon sticks, orange zest, minced chestnuts, and instant coffee in a pot and set to simmer.",
        "Remove from flame once thickened."
      ]
    },
    {
    "chef": ["Akira Hayama"],
    "dish_name": "Köfta Kebab Burger",
    "img_link": "",
    "description":"By using pita bread as the buns, the juices of the burger spill out into the mouth. Köfta was used as the patty, which is a Turkish meatball and, by adding several rich spices to the taste, the burger is consumed so quickly before the person eating even realizes it. The kebab was cooked with multiple spices and all the unwanted smells are masked by a homemade yogurt sauce. Despite the heaviness of the burger, the achaar are the secret condiment, serving as the pickles for the burger.",
      "ingredients": [
          "Köfta Ground beef or lamb",
          "Kebab seasoning (cumin, coriander, paprika, garlic powder, salt, pepper)",
          "Olive oil",
          "Pita bread or burger buns",
          "Lettuce",
          "Tomato slices",
          "Red onion slices",
          "Tzatziki sauce or preferred sauce"
      ],
        "recipe": [
          "Combine ground meat with kebab seasoning in a mixing bowl.",
          "Shape the seasoned meat into burger patties.",
          "Brush patties with olive oil and cook on a grill or skillet until desired doneness (4-5 minutes per side).",
          "Warm pita bread or lightly toast burger buns.",
          "Place a lettuce leaf on the bottom half of the bread.",
          "Add cooked kebab patty on top of the lettuce.",
          "Layer with tomato slices and red onion.",
          "Drizzle tzatziki sauce or preferred sauce over the toppings.",
          "Top with the other half of the bread.",
          "Serve hot with your favorite sides."
        ]
      },
      {
        "chef": ["Megumi Tadoroko"],
        "dish_name": "Dorayaki",
        "img_link": "",
        "description": "Dorayaki (どら焼き, どらやき, 銅鑼焼き, ドラ焼き) is a type of Japanese confection, a red-bean pancake which consists of two small pancake-like patties made from castella wrapped around a filling of sweet Azuki red bean paste. Dorayaki are similar to Imagawayaki, but the latter are cooked with the batter completely surrounding the bean paste filling and are often served hot.",
        "ingredients": [
            "Grilled Castella Pancake made of the following;",
            "Egg",
            "Wasanbon Sugar (Refined Japanese Sugar)",
            "Honey",
            "Mirin",
            "Wheat Flour",
            "Grated Tofu",
            "Apple Butter",
            "Beurre Monte made of the following;",
            "Cold Butter",
            "Water",
            "Grated Apple",
            "Lemon Juice",
            "Lemon",
            "Sugar"
            "White Bean Paste",
            "White Kidney Beans",
            "Cube Cut Apple",
            "Apple",
            "Boiled Pectin",
            "Water",
            "Sugar",
            "Finely Diced Ginger (From Takumi Aldini's Doppio Mezzaluna Pizza)"
          ], 
        "recipe": [
            "In a bowl, whisk together eggs, sugar, and honey until well combined.",
            "Add milk, vegetable oil, and vanilla extract to the egg mixture, and whisk until smooth.",
            "In a separate bowl, sift together all-purpose flour and baking powder.",
            "Gradually add the dry ingredients to the wet ingredients, stirring until just combined.",
            "Heat a non-stick pan over medium heat. Spoon small amounts of batter onto the pan to form pancakes. Cook until bubbles form on the surface, then flip and cook the other side.",
            "For the white bean paste, combine canned azuki beans, sugar, and water in a saucepan. Cook over medium heat until the beans are soft and the mixture thickens. Mash the beans to create a smooth paste.",
            "Place a spoonful of red bean paste between two pancakes to form a Dorayaki.",
            "Repeat the process until all the pancakes are used.",
            "Serve and enjoy your homemade Dorayaki!"
              ]
            },

   {
        "chef": "Joichiro Yukihara",
        "dish_name": "Dried Sardines with Strawberry Jam",
        "img_link": "",
        "description": "A failed Yukihara dish.",
        "ingredients": [
         "1 cup of dried sardines",  
         "1 teaspon of salt",
         "1 cup of strawberries",
         "1/2 cup of sugar",
         "1 tablespoon of lemon juice"
        ],
        "recipe": [
            "Soak the dried sardines in water for 30 minutes to reduce saltiness. Drain and pat dry with paper towels.",
            "In a pan over medium heat, lightly toast the dried sardines until they become crispy. Remove from heat and set aside.",
            "For the strawberry jam, combine strawberries, sugar, and lemon juice in a saucepan. Cook over medium heat until the strawberries break down and the mixture thickens.",
            "Let the strawberry jam cool to room temperature.",
            "Serve the dried sardines garnished with a dollop of strawberry jam on top.",
            "Enjoy your unique and flavorful dried sardines with strawberry jam!"
            ]
  },     
  {
      "chef": ["Soma Yukihira"],
      "dish_name": "Chicken Egg Tempura Don",
      "img_link": "",
      "description": "A frozen egg that is deep-fried in tempura batter, producing a soft-boiled tempura egg over rice. Though the dish uses common, low-grade eggs, the dishes' power comes from this fact as no other egg grade can produce the flavor that dish can create. ",
      "ingredients": [
          "1 Frozen Chicken Egg",
          "Tempura Batter",
          "Sweet & Salty Sauce Blend",
          "Soy Sauce",
          "Mirin",
          "Bonito Dashi Stock",
          "Rice"
        ],
        
      "recipe": [
         "Prepare tempura batter.",
          "Coat the frozen chicken egg with the tempura batter.",
          "Fry the chicken egg until golden brown.",
          "Cook rice.",
          "Place the tempura-fried chicken egg on top of the cooked rice.",
          "Prepare Yukihira Diner's Umami-Packed Sweet & Salty Sauce Blend using soy sauce, mirin, and bonito dashi stock.",
          "Pour the sauce over the chicken egg tempura and rice.",
          "Serve!"
          ]
        },
        {
            "chef": ["Soma Yukihira"],
            "dish_name": "Oyakodon",
            "img_link": "",
            "description": "A comforting Japanese dish made with chicken, eggs, and flavorful broth served over rice.",
            "ingredients": [   
            "7 chicken wings",
            "1 tablespoon sesame seed oil",
            "4 eggs",
            "Diced spring onion",
            "1 tablespoon grated ginger",
            "700cc bonito broth",
            "1 tablespoon sake",
            "1 tablespoon mirin",
            "1 tablespoon sugar",
            "50cc soy sauce",
            "Pinch of salt",
            "Packet of rice"
          ],
            "recipe": [
             "Prepare the Chicken: Heat sesame seed oil in a frying pan. Sauté chicken wings until golden brown on both sides.",
             "Create Broth: Combine cooked chicken, grated ginger, bonito broth, sake, mirin, sugar, and light soy sauce in a pot. Bring to a boil, skim off impurities, and simmer until reduced by half.",
             "Cool and Chill the Broth: Pour broth into a container to cool, then chill in the fridge to solidify.",
             "Prepare the Rice: Follow packet instructions to prepare the rice and keep it warm.",
             "Debone Chicken and Cut Into Strips: Remove chilled solidified broth from the container. Debone chicken wings and cut into strips.",
             "Make Egg Curds: Whisk eggs with sugar and salt. Pour into a frying pan over low heat, stirring rapidly to create curds. Transfer to a plate.",
             "Assemble the Dish: Pour solidified broth (aspic) over hot rice. Add egg curds and chicken strips on top. Sprinkle diced spring onions for garnish."
            ]
          },
          {
              "chef": ["Soma Yukihira"],
              "dish_name": "Mini Soufflé Omelette",
              "img_link": "",
              "description": "By cooking the eggs to form a soufflé, the meal is soft, springy and bouncy. However, once you eat it, it melts in your mouth, just like magic! However, be warned, it must be served quickly before it loses its form.",
              "ingredients": [
                "Flour",
                "Egg Whites",
                "Cream",
                "Egg Yolk",
                "Heavy Cream",
                "Salt",
                "Black Pepper",
                "Sauce",
                "Tomato Sauce",
                "Garlic",
                "Parsley"
              ],
              "recipe": [
               "Prepare a mixture of flour, egg whites, cream, egg yolk, heavy cream, salt, and black pepper.",
               "In a separate saucepan, prepare a sauce using tomato sauce, garlic, and parsley.",
               "Cook the mixture in a skillet or oven until golden brown.",
               "Serve the cooked mixture with the tomato sauce on top.",
               "Garnish with additional parsley if desired."
              ]
            },
            {
                  "chef": ["Ryo Kurokiba"],
                  "dish_name": "French Curry Lobster Rice with Cognac",
                  "img_link": "",
                  "description": "The cognac in particular was of the highest quality, giving the dish the impression of a forest and has the aroma of sandalwood.  It is encouraged to eat the tomalley inside the spiny lobster's head with droplets of cognac then eat the roux and saffron rice.",
                  "ingredients": [
                   "2 lobsters (about 1 1/2 pounds each), cooked and shelled",
                   "2 tablespoons olive oil",
                   "2 shallots, finely chopped",
                   "2 cloves garlic, minced",
                   "1 tablespoon curry powder",
                   "1/2 cup cognac",
                   "1 cup long-grain white rice",
                   "2 cups chicken or seafood broth",
                   "1 cup heavy cream",
                   "Salt and pepper to taste",
                   "Chopped fresh parsley for garnish"
                  ],
              "recipe": [
                "Prepare the Lobster: Cook the lobsters by boiling or steaming until fully cooked. Remove the meat from the shells and chop into bite-sized pieces. Set aside.",
                "Sauté Aromatics: Heat olive oil in a large skillet over medium heat. Add finely chopped shallots and minced garlic. Sauté until translucent and fragrant.",
                "Add Curry and Cognac: Sprinkle curry powder over sautéed aromatics. Stir for a minute. Pour in cognac and simmer until alcohol evaporates.",
                "Cook the Rice: Add uncooked rice to the skillet, stirring to coat with aromatics and spices. Pour in chicken or seafood broth. Bring to a boil, then simmer covered for 15-20 minutes until rice is cooked and liquid is absorbed.",
                "Incorporate Lobster and Cream: Add chopped lobster meat to the skillet. Pour in heavy cream, stirring gently. Simmer for 5-7 minutes until lobster is heated through and sauce thickens slightly.",
                "Season and Garnish: Season with salt and pepper. Garnish with chopped fresh parsley before serving."
                  ]
                },
           {
              "chef": ["Takumi Aldini"],
              "dish_name": "Insalata Frittata",
              "img_link": "",
              "description": "",
              "ingredients": [
                "6 large eggs",
                "1/4 cup grated Parmesan cheese",
                "1 tablespoon olive oil",
                "1 small onion, thinly sliced",
                "1 red bell pepper, diced",
                "1 cup cherry tomatoes, halved",
                "2 cups fresh spinach leaves",
                "Salt and pepper to taste",
                "1/4 cup chopped fresh basil or parsley (optional, for garnish)"
              ],
           "recipe": 
           [
              "Preheat the oven to 350°F (175°C).",
              "In a bowl, whisk together the eggs and grated Parmesan cheese. Set aside."
              "Heat olive oil in an oven-safe skillet over medium heat.",
              "Sauté the thinly sliced onion until translucent.",
              "Add diced red bell pepper and cook until it softens.",
              "Add fresh spinach leaves to the skillet. Stir until they wilt.",
              "Add halved cherry tomatoes to the skillet and cook for a few more minutes until they soften slightly.",
              "Season the sautéed vegetables with salt and pepper to taste.",
              "Pour the whisked egg and Parmesan mixture evenly over the vegetables in the skillet. Cook on the stovetop for 2-3 minutes until the edges start to set.",
              "Transfer the skillet to the preheated oven.",
              "Bake for 10-15 minutes or until the frittata is set in the middle and the top is lightly golden brown.",
              "Remove the frittata from the oven and let it cool for a few minutes.",
              "Optionally, sprinkle chopped fresh basil or parsley on top for garnish.",
              "Cut the frittata into wedges and serve warm or at room temperature."
           ]
          }, 
          {
              "chef": ["Terunori Kuga"],
              "dish_name": "Green Tea Kurozubuta",
              "img_link": "",
              "description": "By using green tea leaves to smoke a pork shoulder combined with a black vinegar sauce which is made by using black vinegar, sugar, crushed green tea leaves, smoked soy sauce, and a french sauce called sauce au vinaigre balsamique which gives look similar to sweet & sour pork. When the diner eats this it the sauce highlights the quality of the ingredients combined with the green tea would flood your vision with fresh vendure.",

              "ingredients": [
                "Green Tea Pork",
                "Pork Shoulder Roast (Smoked)",
                "Green Tea Leaves",
                "Potato Starch",
                "Frying Oil",
                "Black Vinegar Sauce",
                "Black Vinegar",
                "Sugar",
                "Green Tea Leaves (Crushed)",
                "Smoked Soy Sauce (By Subaru Mimasaka)",
                "Sauce au Vinaigre Balsamique",
                "Balsamic Vinegar",
                "Glace de Viande",
                "Fond de Veau",
                "Garnish",
                "Whole Green Tea Leaves",
                "Parsnips (Shredded)"
              ],
            
              "recipe": [
                "Prepare Green Tea Pork by marinating smoked pork shoulder roast with green tea leaves and coating with potato starch.",
                "Heat frying oil and fry the Green Tea Pork until golden brown and crispy.",
                "Prepare Black Vinegar Sauce by combining black vinegar, sugar, and crushed green tea leaves.",
                "Prepare Smoked Soy Sauce by Subaru Mimasaka.",
                "Prepare Sauce au Vinaigre Balsamique by combining balsamic vinegar and Glace de Viande.",
                "Garnish the dish with whole green tea leaves and shredded parsnips.",
                "Serve and enjoy!"
              ]
            },
            {
                "chef": ["Momo Akanegakubo"],
                "dish_name": "Chocolate Covered Checkerboard Cake",
                "img_link": "",
                "description": "A chocolate cake covered in ganache and stylized with a chocolate rose. Each slice of cake has the appearance of a checkerboard on its cross-section, hence the name.",
                "ingredients": [
                  "Chocolate Sponge Cake Base",
                  "Eggs",
                  "Whites",
                  "Yolks",
                  "Chocolate Ganache",
                  "Chopped Chocolate",
                  "Heavy Cream",
                  "Chocolate Rose (Modeling Chocolate)"
                ],
                "recipe": [
                  "Prepare Chocolate Sponge Cake Base using eggs, whites, and yolks.",
                  "Make Chocolate Ganache by combining chopped chocolate and heavy cream.",
                  "Use Modeling Chocolate to create Chocolate Roses.",
                  "Assemble the cake using the Chocolate Sponge Cake Base, layering with Chocolate Ganache.",
                  "Decorate the cake with Chocolate Roses made from Modeling Chocolate.",
                  "Serve"
                ]
            },
            {
                "chef": ["Erina Nakiri"],
                "dish_name": "Eggs Benedict",
                "img_link": "",
                "description": "This dish is a beautiful gem amongst the rubble of other egg dishes. Cooked to perfection by the tried-and-true classic recipe, Erina added a secret weapon to it: Karasumi powder to further enhance the egg theme.",
                "ingredients": [
                  "Ground Chive",
                  "Hollandaise Sauce",
                  "Egg Yolks",
                  "Lemon Juice",
                  "Melted Butter",
                  "Water",
                  "Poached Egg",
                  "Oven Baked Bacon",
                  "English Muffin",
                  "Karasumi Powder",
                  "Dried Mullet Roe",
                  "Dried Various Fish Eggs",
                  "Salt"
                ],
                "recipe": [
                  "Prepare Hollandaise Sauce using egg yolks, lemon juice, and melted butter.",
                  "Poach an egg in water.",
                  "Toast an English Muffin.",
                  "Layer the toasted English Muffin with ground chive, oven-baked bacon, and poached egg.",
                  "Top with Hollandaise Sauce.",
                  "Sprinkle Karasumi Powder (Dried Mullet Roe and Dried Various Fish Eggs) and salt for flavor.",
                  "Serve"
                ]
              },
              {
                  "chef": ["Kojiro Shinomiyav"],
                  "dish_name": "Nine Vegetable Terrine",
                  "img_link": "",
                  "description": "This common French dish utilizes nine different types of vegetables that are aligned in strips/stripes, one above the other, and set in a green gelatinous compound (French: gelée; English: aspic - a savory jelly made with meat stock, set in a mold and used to contain pieces of meat, seafood, eggs or vegetables).",
                  "ingredients": [
                    "Cabbage",
                    "Carrots",
                    "Okra",
                    "Zucchini",
                    "Cauliflower",
                    "Yellow Summer Squash",
                    "Asparagus",
                    "White Asparagus",
                    "Green Asparagus",
                    "Baby Corn",
                    "Sauce",
                    "Egg Yolk",
                    "Thyme Spice",
                    "Mashed Garlic",
                    "Mayonnaise (40g)",
                    "Virgin Olive Oil (10ml)",
                    "Milk (10ml)",
                    "Black Pepper",
                    "Salt",
                    "Garnish",
                    "Leaf",
                    "Cherry Tomatoes"

                  ],
                  "recipe": [
                    "Chop and prepare the vegetables: Cabbage, Carrots, Okra, Zucchini, Cauliflower, Yellow Summer Squash, Asparagus, White Asparagus, Green Asparagus, Baby Corn.",
                    "Prepare the sauce by mixing Egg Yolk, Thyme Spice, Mashed Garlic, Mayonnaise, Virgin Olive Oil, Milk, Black Pepper, and Salt.",
                    "Blanch the vegetables in hot water for a short time, keeping them crisp.",
                    "Arrange the blanched vegetables in a terrine mold, layering them evenly.",
                    "Pour the prepared sauce over the vegetables, ensuring even coverage.",
                    "Garnish the top with leaves and Cherry Tomatoes.",
                    "Refrigerate the terrine for several hours until it sets.",
                    "Slice and serve the vegetable terrine.",
                    "Enjoy your delicious terrine!"
                  ]
                }
        

            
      




  
     
          


            
          
    






   
 

    
    
    

    
  
  